app/controllers/blogposts_controller.rb

SELECT "blogposts".* FROM "blogposts"
---
  def index
    @blogposts = Blogpost.all

INSERT INTO "blogposts" ("title", "author", "date", "image", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @blogpost = Blogpost.new(blogpost_params)

    respond_to do |format|
      if @blogpost.save

UPDATE "blogposts" SET "image" = $1, "updated_at" = $2 WHERE "blogposts"."id" = $3  [["image", "#<ActionDispatch::Http::UploadedFile:0xc0a4268>"], ["updated_at", "2018-08-30 13:53:49.850925"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @blogpost.update(blogpost_params)

SELECT  "blogposts".* FROM "blogposts" WHERE "blogposts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_blogpost
      @blogpost = Blogpost.find(params[:id])